yaxn/keil-pack-milandr/CMSIS_Driver/MDR1986VE9X/MDR1986VE9X_USART.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2015 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        11. October 2015
 * $Revision:    V1.00
 *
 * Driver:       Driver_USART0, Driver_USART1
 * Configured:   via RTE_Device.h configuration file
 * Project:      USART Driver for Milandr MDR1986VE9X
 * -----------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                Value     UART Interface
 *   ---------------------                -----     --------------
 *   Connect to hardware via Driver_USART# = 0      MDR_UART1
 *   Connect to hardware via Driver_UsART# = 1      MDR_UART2
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.00
 *    - Initial release
 */

#include "MDR1986VE9X_USART.h"

#define ARM_USART_DRV_VERSION    ARM_DRIVER_VERSION_MAJOR_MINOR(1, 00)  /* driver version */

// Driver Version
static const ARM_DRIVER_VERSION USART_DriverVersion = {ARM_USART_API_VERSION, ARM_USART_DRV_VERSION};

// UART0
#if (RTE_UART0)
static USART_INFO USART0_Info = {0};

static const USART_RESOURCES USART0_Resources =
{
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode 
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_UART0_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_UART0_CTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    0,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_UART0_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART0_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART0_DTR_PIN_EN == 1)
    1,  // DTR Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART0_DSR_PIN_EN == 1)
    1,  // DSR Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART0_DCD_PIN_EN == 1)
    1,  // DCD Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART0_RI_PIN_EN == 1)
    1,  // RI Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART0_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,
#endif
#if (RTE_UART0_DSR_PIN_EN == 1)
    1,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
#else
    0,
#endif
#if (RTE_UART0_DCD_PIN_EN == 1)
    1,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
#else
    0,
#endif
#if (RTE_UART0_RI_PIN_EN == 1)
    1,  // Signal RI change event: \ref ARM_USART_EVENT_RI
#else
    0,
#endif
  },
    MDR_UART1,
  {     // USART Pin Configuration
    RTE_UART0_TX_FUNC,
		RTE_UART0_TX_PORT,
		RTE_UART0_TX_BIT,
		RTE_UART0_RX_FUNC,
		RTE_UART0_RX_PORT,
		RTE_UART0_RX_BIT,
#if (RTE_UART0_CTS_PIN_EN == 1)
    RTE_UART0_CTS_FUNC,
		RTE_UART0_CTS_PORT,
		RTE_UART0_CTS_BIT,
#else
		PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART0_RTS_PIN_EN == 1)
    RTE_UART0_RTS_FUNC,
		RTE_UART0_RTS_PORT,
		RTE_UART0_RTS_BIT,
#else
		PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART0_DCD_PIN_EN == 1)
    RTE_UART0_DCD_FUNC,
		RTE_UART0_DCD_PORT,
		RTE_UART0_DCD_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART0_DSR_PIN_EN == 1)
		RTE_UART0_DSR_FUNC,
		RTE_UART0_DSR_PORT,
		RTE_UART0_DSR_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART0_DTR_PIN_EN == 1)
    RTE_UART0_DTR_FUNC,
		RTE_UART0_DTR_PORT,
		RTE_UART0_DTR_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART0_RI_PIN_EN == 1)
    RTE_UART0_RI_FUNC,
		RTE_UART0_RI_PORT,
		RTE_UART0_RI_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
  },
  {     // USART Clocks Configuration
		RST_CLK_UART_CLOCK_UART1_CLK_EN | ((RTE_UART0_BRG << RST_CLK_UART_CLOCK_UART1_BRG_Pos) & RST_CLK_UART_CLOCK_UART1_BRG_Msk),
    &(MDR_RST_CLK->UART_CLOCK), RST_CLK_PER_CLOCK_PCLK_EN_UART1, (1 << RTE_UART0_BRG)
  },
	UART1_IRQn,
	&USART0_Info,
};
#endif

// UART1
#if (RTE_UART1)
static USART_INFO USART1_Info = {0};

static const USART_RESOURCES USART1_Resources =
{
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode 
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_UART1_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_UART1_CTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    0,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_UART1_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART1_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART1_DTR_PIN_EN == 1)
    1,  // DTR Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART1_DSR_PIN_EN == 1)
    1,  // DSR Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART1_DCD_PIN_EN == 1)
    1,  // DCD Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART1_RI_PIN_EN == 1)
    1,  // RI Line: 0=not available, 1=available
#else
    0,
#endif
#if (RTE_UART1_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,
#endif
#if (RTE_UART1_DSR_PIN_EN == 1)
    1,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
#else
    0,
#endif
#if (RTE_UART1_DCD_PIN_EN == 1)
    1,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
#else
    0,
#endif
#if (RTE_UART1_RI_PIN_EN == 1)
    1,  // Signal RI change event: \ref ARM_USART_EVENT_RI
#else
    0,
#endif
  },
    MDR_UART2,
  {     // USART Pin Configuration
    RTE_UART1_TX_FUNC,
		RTE_UART1_TX_PORT,
		RTE_UART1_TX_BIT,
		RTE_UART1_RX_FUNC,
		RTE_UART1_RX_PORT,
		RTE_UART1_RX_BIT,
#if (RTE_UART1_CTS_PIN_EN == 1)
    RTE_UART1_CTS_FUNC,
		RTE_UART1_CTS_PORT,
		RTE_UART1_CTS_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART1_RTS_PIN_EN == 1)
    RTE_UART1_RTS_FUNC,
		RTE_UART1_RTS_PORT,
		RTE_UART1_RTS_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART1_DCD_PIN_EN == 1)
    RTE_UART1_DCD_FUNC,
		RTE_UART1_DCD_PORT,
		RTE_UART1_DCD_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART1_DSR_PIN_EN == 1)
		RTE_UART1_DSR_FUNC,
		RTE_UART1_DSR_PORT,
		RTE_UART1_DSR_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART1_DTR_PIN_EN == 1)
    RTE_UART1_DTR_FUNC,
		RTE_UART1_DTR_PORT,
		RTE_UART1_DTR_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
#if (RTE_UART1_RI_PIN_EN == 1)
    RTE_UART1_RI_FUNC,
		RTE_UART1_RI_PORT,
		RTE_UART1_RI_BIT,
#else
    PORT_FUNC_MODE_PORT,
		NULL,
		0,
#endif
  },
  {     // USART Clocks Configuration
		RST_CLK_UART_CLOCK_UART2_CLK_EN | ((RTE_UART1_BRG << RST_CLK_UART_CLOCK_UART2_BRG_Pos) & RST_CLK_UART_CLOCK_UART2_BRG_Msk),
    &(MDR_RST_CLK->UART_CLOCK), RST_CLK_PER_CLOCK_PCLK_EN_UART2, (1 << RTE_UART1_BRG)
  },
	UART2_IRQn,
	&USART1_Info,
};
#endif

//
//   Functions
//

