yaxn/keil-pack-milandr/CMSIS_Driver/MDR1986VE9X/MDR1986VE9X_USART.c
void USART_PinConfigure (MDR_PORT_TypeDef* Port, uint8_t Pin, uint8_t Func, bool PinState)
{
	Port->ANALOG |= (1<<Pin);
	Port->FUNC &= ~(PORT_FUNC_MODE_Msk<<Pin*2);
	Port->FUNC |= (Func<<Pin*2);
	
	if (PinState)
	{
		Port->RXTX &= ~(1<<Pin);
		Port->OE |= (1<<Pin);
		Port->PWR |= (PORT_PWR_Msk<<Pin*2);
		Port->PD &= ~(1<<Pin);
	}
	else
	{
		Port->OE &= ~(1<<Pin);
		Port->GFEN &= ~(1<<Pin);
		Port->PD &= ~(1<<(Pin+PORT_PD_SHM_Pos));
	}
	
	Port->PULL &= ~((1<<Pin) | (1<<(Pin+PORT_PULL_UP_Pos)));
}

void USART_PinUnconfigure (MDR_PORT_TypeDef* Port, uint8_t Pin)
{
	Port->RXTX &= ~(1<<Pin);
	Port->ANALOG &= ~(1<<Pin);
	Port->FUNC &= ~(PORT_FUNC_MODE_Msk<<Pin*2);
	Port->OE &= ~(1<<Pin);
	Port->PWR &= ~(PORT_PWR_Msk<<Pin*2);
	Port->GFEN &= ~(1<<Pin);
	Port->PULL &= ~((1<<Pin) | (1<<(Pin+PORT_PULL_UP_Pos)));
	Port->PD &= ~((1<<Pin) | (1<<(Pin+PORT_PD_SHM_Pos)));
}

void USART_SetBaudrate (uint32_t USART_Baudrate, USART_RESOURCES *usart)
{
	float Div;
	uint16_t DivInt;
	uint8_t DivFl;
	
	Div = RTE_HCLK / usart->clk.div / (16*USART_Baudrate);
	DivInt = floorf (Div);
	DivFl = lroundf ((Div-DivInt)*64+0.5);
	
	usart->reg->IBRD = DivInt;
	usart->reg->FBRD = DivFl;
	usart->reg->LCR_H = usart->reg->LCR_H;
	
	usart->info->baudrate = USART_Baudrate;
}

static ARM_DRIVER_VERSION USART_GetVersion (void)
{
	return USART_DriverVersion;
}

static ARM_USART_CAPABILITIES USART_GetCapabilities (USART_RESOURCES *usart)
{
	return usart->capabilities;
}

static int32_t USART_Initialize (ARM_USART_SignalEvent_t cb_event,
	USART_RESOURCES *usart)
{
	if (usart->info->flags & USART_FLAG_POWERED)
    // Device is powered - could not be re-initialized
    return ARM_DRIVER_ERROR;

  if (usart->info->flags & USART_FLAG_INITIALIZED)
    // Driver is already initialized
    return ARM_DRIVER_OK;
	
	// Initialize USART Run-time Resources
  usart->info->cb_event = cb_event;

  usart->info->status.tx_busy          = 0;
  usart->info->status.rx_busy          = 0;
  usart->info->status.tx_underflow     = 0;
  usart->info->status.rx_overflow      = 0;
  usart->info->status.rx_break         = 0;
  usart->info->status.rx_framing_error = 0;
  usart->info->status.rx_parity_error  = 0;

  usart->info->mode = 0;
	
	// Configure TX pin
	ClkEnPort (usart->pin.tx_port);
	USART_PinConfigure (usart->pin.tx_port, usart->pin.tx_bit, usart->pin.tx_func, PORT_PIN_OUT);
	
	// Configure RX pin
	ClkEnPort (usart->pin.rx_port);
	USART_PinConfigure (usart->pin.rx_port, usart->pin.rx_bit, usart->pin.rx_func, PORT_PIN_IN);
	
	// Configure CTS pin
  if (usart->capabilities.cts)
	{
		ClkEnPort (usart->pin.cts_port);
		USART_PinConfigure (usart->pin.cts_port, usart->pin.cts_bit, usart->pin.cts_func, PORT_PIN_IN);
	}
	
	// Configure RTS pin
  if (usart->capabilities.rts)
	{
		ClkEnPort (usart->pin.rts_port);
		USART_PinConfigure (usart->pin.rts_port, usart->pin.rts_bit, usart->pin.rts_func, PORT_PIN_OUT);
	}
	
	// Configure DCD pin
  if (usart->capabilities.dcd)
	{
		ClkEnPort (usart->pin.dcd_port);
		USART_PinConfigure (usart->pin.dcd_port, usart->pin.dcd_bit, usart->pin.dcd_func, PORT_PIN_IN);
	}
	
	// Configure DSR pin
  if (usart->capabilities.dsr)
	{
		ClkEnPort (usart->pin.dsr_port);
		USART_PinConfigure (usart->pin.dsr_port, usart->pin.dsr_bit, usart->pin.dsr_func, PORT_PIN_IN);
	}
	
	// Configure DTR pin
  if (usart->capabilities.dtr)
	{
		ClkEnPort (usart->pin.dtr_port);
		USART_PinConfigure (usart->pin.dtr_port, usart->pin.dtr_bit, usart->pin.dtr_func, PORT_PIN_OUT);
	}
	
	// Configure RI pin
  if (usart->capabilities.ri)
	{
		ClkEnPort (usart->pin.ri_port);
		USART_PinConfigure (usart->pin.ri_port, usart->pin.ri_bit, usart->pin.ri_func, PORT_PIN_IN);
	}
	
	usart->info->flags = USART_FLAG_INITIALIZED;

  return ARM_DRIVER_OK;
}

static int32_t USART_Uninitialize (USART_RESOURCES *usart)
{
	if (usart->info->flags & USART_FLAG_POWERED)
    // Driver is powered - could not be uninitialized
    return ARM_DRIVER_ERROR;

  if (usart->info->flags == 0)
    // Driver not initialized
    return ARM_DRIVER_OK;
	
	// Reset TX pin configuration
	USART_PinUnconfigure (usart->pin.tx_port, usart->pin.tx_bit);
	
	// Reset RX pin configuration
	USART_PinUnconfigure (usart->pin.rx_port, usart->pin.rx_bit);
	
	// Reset CTS pin configuration
	if (usart->capabilities.cts)
		USART_PinUnconfigure (usart->pin.cts_port, usart->pin.cts_bit);
	
	// Reset RTS pin configuration
	if (usart->capabilities.rts)
		USART_PinUnconfigure (usart->pin.rts_port, usart->pin.rts_bit);
	
	// Reset DCD pin configuration
	if (usart->capabilities.dcd)
		USART_PinUnconfigure (usart->pin.dcd_port, usart->pin.dcd_bit);
	
	// Reset DSR pin configuration
	if (usart->capabilities.dsr)
		USART_PinUnconfigure (usart->pin.dsr_port, usart->pin.dsr_bit);
	
	// Reset DTR pin configuration
	if (usart->capabilities.dtr)
		USART_PinUnconfigure (usart->pin.dtr_port, usart->pin.dtr_bit);
	
	// Reset RI pin configuration
	if (usart->capabilities.ri)
		USART_PinUnconfigure (usart->pin.ri_port, usart->pin.ri_bit);
	
	// Reset USART status flags
  usart->info->flags = 0;

  return ARM_DRIVER_OK;
}

static int32_t USART_PowerControl (ARM_POWER_STATE state,
	USART_RESOURCES *usart)
{
	if ((usart->info->flags & USART_FLAG_INITIALIZED) == 0)
    // Return error, if USART is not initialized
    return ARM_DRIVER_ERROR;

  if (usart->info->status.rx_busy == 1)
    // Receive busy
    return ARM_DRIVER_ERROR_BUSY;

  if (usart->info->flags & USART_FLAG_SEND_ACTIVE)
    // Transmit busy
    return ARM_DRIVER_ERROR_BUSY;
	
  if (usart->info->flags & USART_FLAG_POWERED)
    if (usart->reg->FR & UART_FR_BUSY)
      // Transmit busy
			return ARM_DRIVER_ERROR_BUSY;
		
	switch (state)
	{
    case ARM_POWER_OFF:
      if ((usart->info->flags & USART_FLAG_POWERED) == 0)
        return ARM_DRIVER_OK;

      // Disable UART IRQ
      NVIC_DisableIRQ (usart->irq_num);
			
			usart->reg->CR &= ~UART_CR_UARTEN;   // Disable UART

      // Deactivate UART peripheral clock
      *(usart->clk.peri_cfg) &= ~(usart->clk.peri_cfg_val);
			MDR_RST_CLK->PER_CLOCK &= ~(usart->clk.on_msk);

