yaxn/keil-pack-milandr/CMSIS_Driver/MDR1986VE9X/MDR1986VE9X_USART.c
      usart->info->flags = USART_FLAG_INITIALIZED;
			
      break;
    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_POWER_FULL:
      if (usart->info->flags & USART_FLAG_POWERED)
        return ARM_DRIVER_OK;

      // Activate UART peripheral clock
			MDR_RST_CLK->PER_CLOCK |= (usart->clk.on_msk);
      *(usart->clk.peri_cfg) |= (usart->clk.peri_cfg_val);

      // Reset USART peripheral
			usart->reg->RSR_ECR = 0x00000000;
			usart->reg->ILPR = 0x00000000;
			usart->reg->IBRD = 0x00000000;
			usart->reg->FBRD = 0x00000000;
			usart->reg->LCR_H = 0x00000000;
			usart->reg->CR = 0x00000300;
			usart->reg->IFLS = 0x00000012;

      // Disable transmitter
      usart->reg->CR &= ~UART_CR_TXE;

      // Disable receiver
      usart->reg->CR &= ~UART_CR_RXE;

      // Disable interrupts
      usart->reg->IMSC = 0x00000000;
			usart->reg->ICR = 0x000007FF;

			// Enable modem lines status interrupts
			if (usart->capabilities.cts)
				usart->reg->IMSC |= UART_IMSC_CTSMIM;
			
			if (usart->capabilities.dcd)
				usart->reg->IMSC |= UART_IMSC_DCDMIM;
			
			if (usart->capabilities.dsr)
				usart->reg->IMSC |= UART_IMSC_DSRMIM;
			
			if (usart->capabilities.ri)
				usart->reg->IMSC |= UART_IMSC_RIMIM;
			
			usart->reg->CR |= UART_CR_UARTEN;   // Enable UART

      usart->info->flags = USART_FLAG_POWERED | USART_FLAG_INITIALIZED;

      // Clear and Enable USART IRQ
      NVIC_ClearPendingIRQ (usart->irq_num);
      NVIC_EnableIRQ (usart->irq_num);

      break;
    default: return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
	
  return ARM_DRIVER_OK;
}

static int32_t USART_Send (const void *data, uint32_t num,
	USART_RESOURCES *usart)
{
	if ((data == NULL) || (num == 0))
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0)
    // USART is not configured (mode not selected)
    return ARM_DRIVER_ERROR;

  if (usart->info->flags & USART_FLAG_SEND_ACTIVE)
    // Send is not completed yet
    return ARM_DRIVER_ERROR_BUSY;

  // Set Send active flag
  usart->info->flags |= USART_FLAG_SEND_ACTIVE;
	
	 // Save transmit buffer info
  usart->info->xfer.tx_buf = (uint8_t *)data;
  usart->info->xfer.tx_num = num;
  usart->info->xfer.tx_cnt = 0;
	
	// Start transmit data
  if (usart->reg->FR & UART_FR_TXFE)
		usart->reg->DR = usart->info->xfer.tx_buf[usart->info->xfer.tx_cnt];
	
	// Enable transmit interrupt
	usart->reg->IMSC |= UART_IMSC_TXIM;

  return ARM_DRIVER_OK;
}

static int32_t USART_Receive (void *data, uint32_t num,
	USART_RESOURCES *usart)
{
	if ((data == NULL) || (num == 0))
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0)
    // USART is not configured (mode not selected)
    return ARM_DRIVER_ERROR;

  // Check if receiver is busy
  if (usart->info->status.rx_busy == 1)
    return ARM_DRIVER_ERROR_BUSY;

  // Set RX busy flag
  usart->info->status.rx_busy = 1;
	
	// Save number of data to be received
  usart->info->xfer.rx_num = num;

  // Clear RX statuses
  usart->info->status.rx_break          = 0;
  usart->info->status.rx_framing_error  = 0;
  usart->info->status.rx_overflow       = 0;
  usart->info->status.rx_parity_error   = 0;

  // Save receive buffer info
  usart->info->xfer.rx_buf = (uint8_t *)data;
  usart->info->xfer.rx_cnt =            0;
	
	// RX Line interrupt enable (overrun, framing, parity error, break)
	usart->reg->IMSC |= (UART_IMSC_RXIM | UART_IMSC_FEIM |
		UART_IMSC_PEIM | UART_IMSC_BEIM | UART_IMSC_OEIM);
	
	return ARM_DRIVER_OK;
}

static int32_t USART_Transfer (const void *data_out, void *data_in, uint32_t num,
	USART_RESOURCES *usart)
{
	if ((data_out == NULL) || (data_in == NULL) || (num == 0))
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0)
    // USART is not configured
    return ARM_DRIVER_ERROR;
	
	return ARM_DRIVER_OK;
}

static uint32_t USART_GetTxCount (USART_RESOURCES *usart)
{
	return usart->info->xfer.tx_cnt;
}

static uint32_t USART_GetRxCount (USART_RESOURCES *usart)
{
	return usart->info->xfer.rx_cnt;
}

static int32_t USART_Control (uint32_t control, uint32_t arg,
	USART_RESOURCES *usart)
{
	uint32_t mode;

  if ((usart->info->flags & USART_FLAG_POWERED) == 0)
    // USART not powered
    return ARM_DRIVER_ERROR;

  switch (control & ARM_USART_CONTROL_Msk)
	{
    // Control TX
    case ARM_USART_CONTROL_TX:
      if (arg)
			{
        usart->info->flags |= USART_FLAG_TX_ENABLED;
        usart->reg->CR |= UART_CR_TXE;
				usart->reg->IMSC |= UART_IMSC_TXIM;
      }
			else
			{
        usart->info->flags &= ~USART_FLAG_TX_ENABLED;
        usart->reg->CR &= ~UART_CR_TXE;
				usart->reg->IMSC &= ~UART_IMSC_TXIM;
				usart->reg->ICR |= UART_ICR_TXIC;
      }
			
      return ARM_DRIVER_OK;
    // Control RX
    case ARM_USART_CONTROL_RX:
      if (arg)
			{
        usart->info->flags |= USART_FLAG_RX_ENABLED;
        usart->reg->CR |= UART_CR_RXE;
				// RX Line interrupt enable (overrun, framing, parity error, break)
				usart->reg->IMSC |= (UART_IMSC_RXIM | UART_IMSC_FEIM |
					UART_IMSC_PEIM | UART_IMSC_BEIM | UART_IMSC_OEIM);
      }
			else
			{
        usart->info->flags &= ~USART_FLAG_RX_ENABLED;
				usart->reg->CR &= ~UART_CR_RXE;
				usart->reg->IMSC &= ~(UART_IMSC_RXIM | UART_IMSC_FEIM |
					UART_IMSC_PEIM | UART_IMSC_BEIM | UART_IMSC_OEIM);
				usart->reg->ICR |= (UART_ICR_RXIC | UART_ICR_FEIC |
					UART_ICR_PEIC | UART_ICR_BEIC | UART_ICR_OEIC);
      }
			
      return ARM_DRIVER_OK;
		// Control break
    case ARM_USART_CONTROL_BREAK:
      if (arg)
			{
        if (usart->info->flags & USART_FLAG_SEND_ACTIVE)
					return ARM_DRIVER_ERROR_BUSY;

        usart->reg->LCR_H |= UART_LCR_H_BRK;

        // Set Send active flag
        usart->info->flags |= USART_FLAG_SEND_ACTIVE;
      }
      else
			{
        usart->reg->LCR_H &= ~UART_LCR_H_BRK;

        // Clear Send active flag
        usart->info->flags &= ~USART_FLAG_SEND_ACTIVE;
			}
				
      return ARM_DRIVER_OK;
    // Abort Send
    case ARM_USART_ABORT_SEND:
      // Disable transmit interrupt
      usart->reg->IMSC &= ~UART_IMSC_TXIM;
			usart->reg->ICR |= UART_ICR_TXIC;

