yaxn/keil-pack-milandr/CMSIS_Driver/MDR1986VE9X/MDR1986VE9X_USART.c
static void USART_IRQHandler (USART_RESOURCES *usart)
{
  uint32_t mis, event, buf;

  event = 0;
  mis   = usart->reg->MIS;

	// Transmit register empty
	if (mis & UART_MIS_TXMIS)
	{
		usart->info->xfer.tx_cnt++;
		
		// Check if all data is transmitted
		if (usart->info->xfer.tx_num == usart->info->xfer.tx_cnt)
		{
			// Disable TX interrupt
			usart->reg->IMSC &= ~UART_IMSC_TXIM;
			usart->reg->ICR |= UART_ICR_TXIC;
			
			// Clear TX busy flag
			usart->info->flags &= ~USART_FLAG_SEND_ACTIVE;
			
			event |= ARM_USART_EVENT_SEND_COMPLETE;
    }
		else
			// Write data to transmit register
			usart->reg->DR = usart->info->xfer.tx_buf[usart->info->xfer.tx_cnt];
	}

  // Receive data interrupt
	if (mis & UART_MIS_RXMIS)
	{
		// Read data from receive register into receive buffer
		buf = usart->reg->DR;
		usart->info->xfer.rx_buf[usart->info->xfer.rx_cnt] = buf & UART_DR_DATA_Msk;
			
		// Check RX line interrupt for errors
		// OverRun error
		if (buf & UART_DR_OE)
		{
			usart->info->status.rx_overflow = 1;
			event |= ARM_USART_EVENT_RX_OVERFLOW;
		}
			
		// Parity error
		if (buf & UART_DR_PE)
		{
			usart->info->status.rx_parity_error = 1;
			event |= ARM_USART_EVENT_RX_PARITY_ERROR;
		}

		// Break detected
		if (buf & UART_DR_BE)
		{
			usart->info->status.rx_break = 1;
			event |= ARM_USART_EVENT_RX_BREAK;
		}

		// Framing error
		if (buf & UART_DR_FE)
		{
			usart->info->status.rx_framing_error = 1;
			event |= ARM_USART_EVENT_RX_FRAMING_ERROR;
		}
			
		usart->info->xfer.rx_cnt++;

		// Check if requested amount of data is received
		if (usart->info->xfer.rx_cnt == usart->info->xfer.rx_num)
		{
			// Disable receive and errors interrupt
			usart->reg->IMSC &=  ~(UART_IMSC_RXIM | UART_IMSC_FEIM |
					UART_IMSC_PEIM | UART_IMSC_BEIM | UART_IMSC_OEIM);
			usart->reg->ICR |= (UART_ICR_RXIC | UART_ICR_FEIC |
					UART_ICR_PEIC | UART_ICR_BEIC | UART_ICR_OEIC);
				
			// Clear RX busy flag and set receive transfer complete event
			usart->info->status.rx_busy = 0;
				
			event |= ARM_USART_EVENT_RECEIVE_COMPLETE;
		}
	}

	// CTS state changed
	if ((usart->capabilities.cts) && (mis & UART_MIS_CTSMMIS))
	{
		event |= ARM_USART_EVENT_CTS;
		usart->reg->ICR |= UART_ICR_CTSMIC;
	}
			
	// DSR state changed
	if ((usart->capabilities.dsr) && (mis & UART_MIS_DSRMMIS))
	{
		event |= ARM_USART_EVENT_DSR;
		usart->reg->ICR |= UART_ICR_DSRMIC;
	}
			
	// Ring indicator
	if ((usart->capabilities.ri) && (mis & UART_MIS_RIMMIS))
	{
		event |= ARM_USART_EVENT_RI;
		usart->reg->ICR |= UART_ICR_RIMIC;
	}
			
	// DCD state changed
	if ((usart->capabilities.dcd) && (mis & UART_MIS_DCDMMIS))
	{
		event |= ARM_USART_EVENT_DCD;
		usart->reg->ICR |= UART_ICR_DCDMIC;
	}
	
  if (usart->info->cb_event && event)
    usart->info->cb_event (event);
}

// End USART Interface

#if (RTE_UART0)
// USART0 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART0_GetCapabilities (void)
{
  return USART_GetCapabilities (&USART0_Resources);
}

static int32_t USART0_Initialize (ARM_USART_SignalEvent_t cb_event)
{
  return USART_Initialize (cb_event, &USART0_Resources);
}

static int32_t USART0_Uninitialize (void)
{
  return USART_Uninitialize (&USART0_Resources);
}

static int32_t USART0_PowerControl (ARM_POWER_STATE state)
{
  return USART_PowerControl (state, &USART0_Resources);
}

static int32_t USART0_Send (const void *data, uint32_t num)
{
  return USART_Send (data, num, &USART0_Resources);
}

static int32_t USART0_Receive (void *data, uint32_t num)
{
  return USART_Receive (data, num, &USART0_Resources);
}

static int32_t USART0_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num)
{
  return USART_Transfer (data_out, data_in, num, &USART0_Resources);
}

static uint32_t USART0_GetTxCount (void)
{
  return USART_GetTxCount (&USART0_Resources);
}

static uint32_t USART0_GetRxCount (void)
{
  return USART_GetRxCount (&USART0_Resources); 
}

static int32_t USART0_Control (uint32_t control, uint32_t arg)
{
  return USART_Control (control, arg, &USART0_Resources);
}

static ARM_USART_STATUS USART0_GetStatus (void)
{
  return USART_GetStatus (&USART0_Resources);
}

static int32_t USART0_SetModemControl (ARM_USART_MODEM_CONTROL control)
{
  return USART_SetModemControl (control, &USART0_Resources);
}

static ARM_USART_MODEM_STATUS USART0_GetModemStatus (void)
{
  return USART_GetModemStatus (&USART0_Resources);
}

void UART1_IRQHandler (void)
{
  USART_IRQHandler (&USART0_Resources);
}

// USART0 Driver Control Block
ARM_DRIVER_USART Driver_USART0 =
{
	USART_GetVersion,
  USART0_GetCapabilities,
  USART0_Initialize,
  USART0_Uninitialize,
  USART0_PowerControl,
  USART0_Send, 
  USART0_Receive,
  USART0_Transfer,
  USART0_GetTxCount,
  USART0_GetRxCount,
  USART0_Control,
  USART0_GetStatus,
  USART0_SetModemControl,
	USART0_GetModemStatus
};
#endif

#if (RTE_UART1)
// USART1 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART1_GetCapabilities (void)
{
  return USART_GetCapabilities (&USART1_Resources);
}

static int32_t USART1_Initialize (ARM_USART_SignalEvent_t cb_event)
{
  return USART_Initialize (cb_event, &USART1_Resources);
}

static int32_t USART1_Uninitialize (void)
{
  return USART_Uninitialize (&USART1_Resources);
}

static int32_t USART1_PowerControl (ARM_POWER_STATE state)
{
  return USART_PowerControl (state, &USART1_Resources);
}

static int32_t USART1_Send (const void *data, uint32_t num)
{
  return USART_Send (data, num, &USART1_Resources);
}

static int32_t USART1_Receive (void *data, uint32_t num)
{
  return USART_Receive (data, num, &USART1_Resources);
}

static int32_t USART1_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num)
{
  return USART_Transfer (data_out, data_in, num, &USART1_Resources);
}

static uint32_t USART1_GetTxCount (void)
{
  return USART_GetTxCount (&USART1_Resources);
}

static uint32_t USART1_GetRxCount (void)
{
  return USART_GetRxCount (&USART1_Resources); 
}

static int32_t USART1_Control (uint32_t control, uint32_t arg)
{
  return USART_Control (control, arg, &USART1_Resources);
}

static ARM_USART_STATUS USART1_GetStatus (void)
{
  return USART_GetStatus (&USART1_Resources);
}

static int32_t USART1_SetModemControl (ARM_USART_MODEM_CONTROL control)
{
  return USART_SetModemControl (control, &USART1_Resources);
}

static ARM_USART_MODEM_STATUS USART1_GetModemStatus (void)
{
  return USART_GetModemStatus (&USART1_Resources);
}

void UART2_IRQHandler (void)
{
  USART_IRQHandler (&USART1_Resources);
}

// USART1 Driver Control Block
ARM_DRIVER_USART Driver_USART1 =
{
	USART_GetVersion,
  USART1_GetCapabilities,
  USART1_Initialize,
  USART1_Uninitialize,
  USART1_PowerControl,
  USART1_Send, 
  USART1_Receive,
  USART1_Transfer,
  USART1_GetTxCount,
  USART1_GetRxCount,
  USART1_Control,
  USART1_GetStatus,
  USART1_SetModemControl,
	USART1_GetModemStatus
};
#endif
